<template>
<h3>สถานที่เที่ยวใกล้ๆ</h3>
<div class="col" v-for="(travel, index) in neartravel" :key="index">
      <div class="name">
        <div class="name">
        <img :src="travel.img" alt="รูปภาพ 1">
        <br><br>
        <h4>{{ travel.name }}</h4>
      </div>
      <div class="titravel">
        <p>{{ travel.text_box }}</p>
        <p>สถานที่ : {{ travel.Location }}</p>
        <p>เบอร์ติดต่อ : {{ travel.phone }}</p>
        <p>เวลา : {{ travel.time }}</p>
        <p>พิกัด : <a :href="near.place">{{ near.place }}</a></p>
      </div>
    </div>
  </div>
</template>

<script setup>
import { ref } from 'vue';



const neartravel=ref([
{ name: 'Giant tree alley' , 
  img: "https://www.paiduaykan.com/travel/wp-content/uploads/2022/11/3-DSC06939.jpg",
  text_box:'ถนนอุโมงค์ต้นไม้เชียงดาว ที่กำลังเป็นจุดถ่ายรูปยอดฮิตของนักท่องเที่ยวที่มาเยือนเมืองเชียงดาว อุโมงค์ต้นไม้แห่งนี้ คือ ต้นยางสูงใหญ่ตั้งเรียงรายไปตามโค้งถนน  เส้นทางไปยังวัดถ้ำเชียงดาวและเมืองคอง ซึ่งบางช่วงของถนนมีความโค้งและมีแสงสวยในยามบ่ายและเช้าส่องลงมา กลายเป็นภาพถนนที่สวยงาม' ,
  Location:'-' ,
  place:'-',
  phone:'-',
  time:'-',
},
{ name: '.Pronto Coffee Thailand' , 
  img: "https://coffcafe.com/wp-content/uploads/2022/09/Pronto-Coffee-Chiangdao-1024x620.jpg",
  text_box:'สัมผัสกับธรรวมชาติและอากาศบริสุทธิ์ได้เต็มที่ นั่งมองวิวดอยหลวงเชียงดาว ขุนเขาอันยิ่งใหญ่สูงอันดับ3 ของประเทศไทยที่ตั้งตระหง่านอยู่ตรงหน้าคุณแบบสัมผัสได้ ไม่ว่าจะมาเที่ยวฤดูไหนๆ อากาศดีทั้งปี แวะมานั่งพักผ่อนพร้อมด้วยการจิบกาแฟอร่อยๆ และเครื่องดื่มอีกมากมายหลากหลายรายการให้เลือกดื่มๆกันได้อย่างจุใจ' ,
  Location:'ตำบลเชียงดาว อำเภอเชียงดาว เชียงใหม่ 50170' ,
  place:'-',
  phone:'02-870-4554',
  time:' เปิดทุกวัน 7:00-18:00 น.',
},
{ name: 'ฮกหลง' , 
  img: "https://www.topchiangmai.com/wp-content/uploads/2022/07/%E0%B8%AE%E0%B8%81%E0%B8%AB%E0%B8%A5%E0%B8%87-%E0%B9%80%E0%B8%8A%E0%B8%B5%E0%B8%A2%E0%B8%87%E0%B8%94%E0%B8%B2%E0%B8%A726.jpg",
  text_box:'ป็นกระท่อมมุงหญ้าคา ที่อยู่ใจกลางหุบเขา ไม่ไกลตัวอำเภอเชียงดาว จังหวัดเชียงใหม่ เป็นที่ตั้งของร้านกาแฟและที่พักสำหรับนักเดินทางที่มีความชื่นชอบธรรมชาติ ชื่อว่า ฮกหลง (Hoklhong Cafe) ที่แปลว่า มังกร มังกรที่ซ่อนกายเงียบๆ อยู่ท่ามกลางความสงบแห่งขุนเขาหลวงเชียงดาว โดยมีเจ้าของร้านอย่าง คุณ‘ยุทธ์’ – ธีรยุทธ์ จันทโชติ ที่คอยต้อนรับนักเดินทาง และคั่วกาแฟเอง บดเอง และชงเองกับมือ' ,
  Location:': ตำบลเชียงดาว อำเภอเชียงดาว เชียงใหม่' ,
  place:'https://goo.gl/maps/E5jfS1sGcarmwqkf8',
  phone:'086-3464624',
  time:' 09.00 – 17.00 น.',
},
{ name: 'ศูนย์ฝึกช้างเชียงดาว' , 
  img: "https://roijang.com/wp-content/uploads/2023/05/shutterstock_1923442577.jpg",
  text_box:'ศูนย์ฝึกช้างเชียงดาวเป็นสถานที่ เชียงดาวที่เที่ยว อีกหนึ่งแห่งของการท่องเที่ยวทางธรรมชาติมีลักษณะคือ จะอยู่ท่ามกลางธรรมชาติ ภูเขาโอบล้อม นักท่องเที่ยวที่จะเข้ามาชมช้างที่นี่จะต้องเดินข้ามสะพานแขวนข้ามแม่น้ำแม่ปิงเข้าไป สะพานที่นี่จะมีลักษณะเด่น สร้างความตื่นเต้นให้กับนักท่องเที่ยวที่เข้ามาเที่ยวสถานที่แห่งนี้ นักท่องเที่ยวที่ได้เข้าไปถือว่าคุ้มค่าเพราะจะได้พบเจอกิจกรรม การแสดงของช้าง ในแต่ละช่วงเวลา และอีกหนึ่งกิจกรรมที่สร้างจุดเด่นให้กับสถานที่แห่งนี้นั่นคือ การขี่ช้างลุยแม่น้ำ จึงทำให้สร้างความเพลิดเพลินเป็นเข้าสู่ธรรมชาติได้อย่างแท้จริง' ,
  Location:'ตำบลเชียงดาว อำเภอเชียงดาว จังหวัดเชียงใหม่' ,
  place:' https://goo.gl/maps/2pFFyhN3cDEdzuWA6',
  Price:'-',
  phone:'-',
  time:'08:00 – 13:00 น.',
},
{ name: 'ไร่ภูผาหมวก' , 
  img: "https://roijang.com/wp-content/uploads/2023/05/shutterstock_2277546695.jpg",
  text_box:'หน้าหนาวก็ต้องมาพร้อมกับที่เที่ยวหน้าหนาว ขอฝากไร่ภูผาหมวกไว้ในอ้อมกอดของนักท่องเที่ยวอีกหนึ่งแห่ง ไร่ภูผาหมวกสวยงดงาม อารมณ์เหมือนวิ่งเล่นอยู่ในสวนดอกไม้เป็น ที่เที่ยวเชียงดาว ที่ได้ใกล้ชิดกับธรรมชาติที่สุดมีทุ่งดอกไม้หลากสี มีที่พักเป็นกระท่อมได้สัมผัสกับธรรมชาติ ความเรียบง่าย โดดเด่นด้วยรูปร่างที่แปลกตา ตัวกระท่อมอาจจะไม่ได้หรูหรา ไม่ได้มีรูปร่างที่สวยงามแต่บอกเลยว่าทุกคนที่ได้มาพักผ่อนที่ไร่ภูผาหมวกนี้จะได้รับความสุขกลับไปเต็มเปี่ยม ในวันที่ท้องฟ้าโปร่งใสก็จะมีความสวยในตัวของมัน ตกกลางคืนออกมานอนดูดาวได้อย่างสุดฟิน' ,
  Location:'ไร่ภูผาหมวก ตำบล ปิงโค้ง อำเภอเชียงดาว เชียงใหม่ 50170' ,
  place:'-',
  phone:'097 950 5297',
time:'08:00-18:00 น.'},
  
])
</script>

<script>
export default {
  props: ['placeName', 'description'],
  methods: {
    navigateToTravelDetail() {
        this.$router.push({ name: 'TravelDetail', params: { id: this.placeName } });
    },
  },
}
</script>

<style>

.card-img-top{
height: 100%;
padding: 25px;

}
.box_all{
justify-content: center;
align-items: center;
margin-left: 30%;
text-align: center
}

</style>
