<template>
    <h3>ที่พัก</h3>
    <div class="col" v-for="(stay, index) in stayy" :key="index">
      <div class="name">
        <div class="name">
        <img :src="stay.img" alt="รูปภาพ 1">
        <img :src="stay.img2" alt="รูปภาพ 2">
        <br><br>
        <h4>{{ stay.name }}</h4>
      </div>
      <div class="tipark">
        <p>{{ stay.text_box }}</p>
        <p>สถานที่ : {{ stay.Location }}</p>
        <p>เบอร์ติดต่อ : {{ stay.phone }}</p>
        <p>ราคา :{{ stay.Price }}</p>
        <p>Facebook : <a :href="stay.link">{{ stay.Facebook }}</a></p>
      </div>
    </div>
  </div>
</template>

<script setup>
import { ref } from 'vue';

const stayy=ref([
  {name: 'บ้านปลายดอย' , 
  img: "https://www.tripgether.com/wp-content/uploads/2022/10/Banpaidoi-5.jpg",
  img2: "https://www.tripgether.com/wp-content/uploads/2022/10/Banpaidoi-17.jpg",
  text_box:'ที่พักใกล้ดอยอินทนนท์ สไตล์ฟาร์มสเตย์ที่มาพร้อมวิวภูเขาและสวนดอกไม้น่ารักๆ ความพิเศษก็คือที่นี่เหมาะกับคนที่ชื่นชอบความเงียบสงบ ต้องการพักผ่อนแบบสบายๆ ท่ามกลางธรรมชาติ เพราะมีบ้านพักเพียง 5 หลังเท่านั้น แบ่งออกเป็นบ้าน 2 แบบ คือ บ้านหลังใหญ่ที่รองรับผู้เข้าพักได้ 4 คน และบ้านหลังเล็กที่รองรับผู้เข้าพักได้ 2 คน บอกเลยว่ายิ่งช่วงหน้าหนาวที่บ้านปลายดอย – อินทนนท์ อุณหภูมิจะอยู่ที่ประมาณ 10 องศาเท่านั้น อากาศเย็นสบายสุดๆ นอกจากนั้นที่พักยังมีทั้งลานแคมป์ไฟ แปลงผักผลไม้ตามฤดูกาล ทุ่งนาหลังบ้าน และแกะสุดน่ารักที่สามารถให้อาหารและถ่ายรูปคู่ชิคๆ ได้ด้วย'  ,
  Location: '72/2 บ้านป่ากล้วย ม.17 ต.แม่วิน อ.แม่วาง จ.เชียงใหม่',
  phone: '083 433 1478',
  Price: 'ราคาเริ่มต้น 2,000 – 4,000 บาท/คืน **รวมอาหารเช้าและชุดหมูกระทะตอนเย็น (ราคาห้องพักอาจมีการเปลี่ยนแปลงกรุณาโทรสอบถามอีกครั้ง)',
  Facebook:'Facebook: บ้านปลายดอย – อินทนนท์ / Baan Plai Doi',
},
  {name: 'เดอะการ์เดน เต็นท์แอนด์เฮาส์, เชียงใหม่ (The Garden Tent&House)' , 
  img: "https://www.tripgether.com/wp-content/uploads/2022/10/TheGardenTentAndHouse67.jpg",
  img2:"https://www.reviewchiangmai.com/wp-content/uploads/2018/11/45776595_365711477505898_3460339778975694848_n.jpg",
  text_box:'ที่พักใกล้อุทยานแห่งชาติดอยอินทนนท์ The Garden Tent&House ท่ามกลางธรรมชาติแบบ 360 องศา ที่ถูกโอบล้อมไปด้วยความเขียวขจีของภูเขาและต้นไม้มากมาย ส่วนของที่พักมีให้เลือกทั้งแบบเต้นท์และบ้านพัก ภายในมาพร้อมสิง่อำนวยความสะดวกต่างๆ ครบ ไม่ว่าจะผ้าเช็ดตัวผ้าเช็ดผม โซฟา โต๊ะเก้าอี้หน้าบ้าน แอร์ ทีวี ตู้เย็น เครื่องทำน้ำอุ่น กาต้มน้ำร้อน และไดร์เป่าผม พื้นที่ของที่พักยังกว้างขวางสามารถเดินเล่นสูดอากาศดีๆ ได้แบบชิลล์ๆ นอกจากนั้นยังมีทั้งลานหญ้าและซุ้มรอบกองไฟให้ทำกิจกรรมกันด้วย และไฮไลท์ของที่พัก The Garden Tent&House คือจากบริเวณที่พักนอกจากจะเห็นวิวภูเขาและสายหมอกแล้ว ยังสามารถมองเห็นน้ำตกสิริภูมิได้อีกด้วย'  ,
  Location:'บ้านขุนกลาง ต.บ้านหลวง อ.จอมทอง จ.เชียงใหม่',
  phone:'052 066 946',
  Price:'ราคาเริ่มต้น 1,575 – 2,400 บาท **ราคารวมอาหารเช้า (ราคาห้องพักอาจมีการเปลี่ยนแปลงกรุณาโทรสอบถามอีกครั้ง)',
  link: 'www.thegarden-th.com',
  Facebook:'The Garden Tent&House',

},
{ name:'บ้านสวนอริยะ เชียงใหม่ (Baan Suan Ariya)' , 
  img: "https://www.tripgether.com/wp-content/uploads/2022/10/Bansuanariya-97.jpg",
  img2: "https://www.tripgether.com/wp-content/uploads/2022/10/Bansuanariya-8.jpg",
  text_box:'ที่พักดอยอินทนนท์ ติดภูเขา วิวธรรมชาติแบบเต็มๆ มาพร้อมที่พักให้เลือกหลายแบบทั้ง บ้านพักพร้อมดาดฟ้า เต็นท์ VIP และแคมป์ บริเวณที่พักยังมีทั้งแปลงดอกไม้ที่หมุนเวียนไปตามซีซั่น ไม่เท่านั้นยังมีสวนผักและสวนผลไม้ไม่ว่าจะ องุ่น สตรอว์เบอร์รี่ ลูกท้อ อะโวคาโด และเสาวรส ให้เก็บแบบสดๆ บอกเลยว่าฟินมาก ช่วงเย็นยังสามารถสั่งหมูกระทะมากินเคล้าอากาศเย็นๆ หน้าที่พักได้อีกด้วย ใครมองหาที่พักท่ามกลางธรรมชาติและสวนผลไม้แนะนำเลยว่ามาที่บ้านสวนอริยะถูกใจแน่นอน' ,
  Location:'159 ม.7 หมู่บ้านขุนกลาง ต.บ้านหลวง อ.จอมทอง จ.เชียงใหม่' ,
  phone:'084 366 4300',
  Price:'ช่วงเดือนตุลาคม – พฤศจิกายน ราคาเริ่มต้น 800 บาท **ราคารวมอาหารเช้า ช่วงเดือนธันวาคม – มกราคม ราคาเริ่มต้น 1,000 บาท **ราคารวมอาหารเช้า (ราคาห้องพักอาจมีการเปลี่ยนแปลงกรุณาโทรสอบถามอีกครั้ง)',
  Facebook:'บ้านสวนอริยะ ที่พักดอยอินทนนท์',
},
{ name: 'บ้านไม้ไผ่ยักษ์, เชียงใหม่ (Giant Bamboo Hut)' , 
  img: "https://www.tripgether.com/wp-content/uploads/2022/10/Giantbamboo-13.jpg",
  img2: "https://www.atmangu.com/uploads/article/t2o962GR0PWZUN7VdTm1j5Ip0UFjw24c.jpg",
  text_box:'ที่พักดอยอินทนนท์ บ้านแม่กลางหลวง ที่ด้านหลังติดภูเขา ด้านหน้าติดทุ่งนา เรียกได้ว่าโอบล้อมด้วยธรรมชาติแบบ 360 องศา ในบรรยากาศอันแสนเงียบสงบให้คุณได้พักผ่อนและฟังเสียงธรรมชาติ นกร้อง น้ำไหล สายลมได้แบบสบายๆ ไม่เท่านั้นเดินถัดจากทุ่งนาไปยังมีน้ำตกสายเล็กๆ ไหลผ่านให้แช่เท้าเติมความสดชื่นกันได้อีกด้วย บอกเลยว่าเมื่อเข้าพักที่ Giant Bamboo Hut บ้านไม้ไผ่ยักษ์ คุณจะได้ใกล้ชิดธรรมชาติอย่างแท้จริง คุ้มค่าแก่การพาร่างกายมาชาร์จแบตในวันหยุดอย่างแน่นอน' ,
  Location:'บ้านแม่กลางหลวง อ.จอมทอง จ.เชียงใหม่' ,
  phone:'081 881 2471',
  Price:' ราคาเข้าพักสำหรับ 1 – 2 คน 1500 บาท/คน และราคาเข้าพักสำหรับ 3 คนขึ้นไป 1200 บาท/คน **รวมอาหาร 2 มื้อ เช้าและเย็น (ราคาอาจมีการเปลี่ยนแปลง กรุณาโทรสอบถามล่วงหน้า',
  Facebook:'Giant Bamboo Hut',
},
{ name:'โปโป&ปิงปิง ขุนวาง, เชียงใหม่ (PoPo & Pingping Farm Stay)' , 
  img: "https://img.wongnai.com/p/1920x0/2020/12/30/4e6b0962c02b4ebaa9e04dffb8998d17.jpg",
  img2: "https://www.tripgether.com/wp-content/uploads/2022/10/Pingpingandpopo-32.jpg",
  text_box:'เป็นที่พักเล็กๆ ตั้งอยู่กลางหมู่บ้านขุนวาง ชาวเขาเผ่าม้งบนดอยอินทนน์ ตกแต่งฟีลลิ่งญี่ปุ่นสุดน่ารัก บริเวณที่พักยังรายล้อมไปด้วยไม้ดอกและไม้ประดับมากมายที่ให้ความรู้สึกสดชื่นเข้ากับอากาศเย็นๆ เป็นที่สุด แอบกระซิบว่าที่ โปโป&ปิงปิง ขุนวาง นั้นเปิดให้เข้าพักเป็นช่วงๆ สามารถติดตามการเปิดให้จองได้ทางเฟซบุ๊กที่พักได้เลย นอกจากที่พักแล้วยังมีโซนคาเฟ่ให้นั่งชิลล์กันด้วย ใครมองหาที่พักดอยอินทนนท์น่ารักๆ ถ่ายรูปสวยแนะนำที่นี่เลย' ,
  Location:'80 ม.12 ต.แม่วิน อ.แม่วาง จ.เชียงใหม่' ,
  phone:'087 578 4946, 095 453 4784',
  Price:'เปิดให้เข้าพักตั้งแต่เดือนมิถุนายน – เดือนกุมภาพันธ์ ราคาเริ่มต้น 700 บาท/คน/คืน **รวมอาหารเช้า (ราคาอาจมีการเปลี่ยนแปลงกรุณาโทรสอบถามอีกครั้ง)',
  Facebook:'โปโป&ปิงปิง ขุนวาง',
},
])
</script>

<style>

.card-img-top{
height: 100%;
padding: 25px;

}
.box_all{
justify-content: center;
align-items: center;
margin-left: 30%;
text-align: center
}

</style>
