<template>
  <div class="col" v-for="(n) in travellist" :key="n">
    <div class="name">
      <h3>{{ n.name }}</h3>
    </div>
    <div class="tipark">
      <RouterLink to="ที่พัก">ที่พัก</RouterLink> /
      <RouterLink to="สถานที่เที่ยว">สถานที่เที่ยว</RouterLink>
    </div>
    <br>
  <br>
    <div class="col" v-for="(stay, index) in stayy" :key="index">
      <div class="name">
        <div class="name">
        <img :src="stay.img" alt="รูปภาพ 1">
        <img :src="stay.img2" alt="รูปภาพ 2">
        <br><br>
        <h4>{{ stay.name }}</h4>
      </div>
      <div class="tipark">
        <p>{{ stay.text_box }}</p>
        <p>สถานที่ : {{ stay.Location }}</p>
        <p>เบอร์ติดต่อ : {{ stay.phone }}</p>
        <p>ราคา :{{ stay.Price }}</p>
        <p>Facebook : {{ stay.Facebook }}</p>
        <a :href=" stay.link">ที่พัก</a>
      </div>
    </div>
  </div>
  <h3>สถานที่เที่ยวใกล้ๆ</h3>
  <div class="col" v-for="(near, index) in neartravel" :key="index">
      <div class="name">
        <div class="name">
        <img :src="near.img" alt="รูปภาพ 1">
        <img :src="near.img2" alt="รูปภาพ 2">
        <h4>{{ near.name }}</h4>
      </div>
      <div class="titravel">
        <p>{{ near.text_box }}</p>
        <p>สถานที่ : {{ near.Location }}</p>
        <p>เบอร์ติดต่อ : {{ near.phone }}</p>
        <p>ราคา :{{ near.Price }}</p>
        <p>เวลา : {{ near.time }}</p>
        <a :href=" + near.place">พิกัด</a>
      </div>
    </div>
  </div>
  </div>
</template>

<script setup>

import { ref } from 'vue';

const travellist=ref([
{name: 'ดอยอินทนนท์', img:"https://www.reviewchiangmai.com/wp-content/uploads/2022/06/doi-inthanon-1536x1024.jpg", quantity: 0 ,
text_box:'เดินทางโดยสวัสดิภาพ'
}])

const stayy=ref([
  {name: 'บ้านปลายดอย' , 
  img: "https://www.tripgether.com/wp-content/uploads/2022/10/Banpaidoi-5.jpg",
  img2: "https://www.tripgether.com/wp-content/uploads/2022/10/Banpaidoi-17.jpg",
  text_box:'ที่พักใกล้ดอยอินทนนท์ สไตล์ฟาร์มสเตย์ที่มาพร้อมวิวภูเขาและสวนดอกไม้น่ารักๆ ความพิเศษก็คือที่นี่เหมาะกับคนที่ชื่นชอบความเงียบสงบ ต้องการพักผ่อนแบบสบายๆ ท่ามกลางธรรมชาติ เพราะมีบ้านพักเพียง 5 หลังเท่านั้น แบ่งออกเป็นบ้าน 2 แบบ คือ บ้านหลังใหญ่ที่รองรับผู้เข้าพักได้ 4 คน และบ้านหลังเล็กที่รองรับผู้เข้าพักได้ 2 คน บอกเลยว่ายิ่งช่วงหน้าหนาวที่บ้านปลายดอย – อินทนนท์ อุณหภูมิจะอยู่ที่ประมาณ 10 องศาเท่านั้น อากาศเย็นสบายสุดๆ นอกจากนั้นที่พักยังมีทั้งลานแคมป์ไฟ แปลงผักผลไม้ตามฤดูกาล ทุ่งนาหลังบ้าน และแกะสุดน่ารักที่สามารถให้อาหารและถ่ายรูปคู่ชิคๆ ได้ด้วย'  ,
  Location: '72/2 บ้านป่ากล้วย ม.17 ต.แม่วิน อ.แม่วาง จ.เชียงใหม่',
  phone: '083 433 1478',
  Price: 'ราคาเริ่มต้น 2,000 – 4,000 บาท/คืน **รวมอาหารเช้าและชุดหมูกระทะตอนเย็น (ราคาห้องพักอาจมีการเปลี่ยนแปลงกรุณาโทรสอบถามอีกครั้ง)',
  Facebook:'Facebook: บ้านปลายดอย – อินทนนท์ / Baan Plai Doi',
},
  {name: 'เดอะการ์เดน เต็นท์แอนด์เฮาส์, เชียงใหม่ (The Garden Tent&House)' , 
  img: "https://www.tripgether.com/wp-content/uploads/2022/10/TheGardenTentAndHouse67.jpg",
  img2:"https://www.reviewchiangmai.com/wp-content/uploads/2018/11/45776595_365711477505898_3460339778975694848_n.jpg",
  text_box:'ที่พักใกล้อุทยานแห่งชาติดอยอินทนนท์ The Garden Tent&House ท่ามกลางธรรมชาติแบบ 360 องศา ที่ถูกโอบล้อมไปด้วยความเขียวขจีของภูเขาและต้นไม้มากมาย ส่วนของที่พักมีให้เลือกทั้งแบบเต้นท์และบ้านพัก ภายในมาพร้อมสิง่อำนวยความสะดวกต่างๆ ครบ ไม่ว่าจะผ้าเช็ดตัวผ้าเช็ดผม โซฟา โต๊ะเก้าอี้หน้าบ้าน แอร์ ทีวี ตู้เย็น เครื่องทำน้ำอุ่น กาต้มน้ำร้อน และไดร์เป่าผม พื้นที่ของที่พักยังกว้างขวางสามารถเดินเล่นสูดอากาศดีๆ ได้แบบชิลล์ๆ นอกจากนั้นยังมีทั้งลานหญ้าและซุ้มรอบกองไฟให้ทำกิจกรรมกันด้วย และไฮไลท์ของที่พัก The Garden Tent&House คือจากบริเวณที่พักนอกจากจะเห็นวิวภูเขาและสายหมอกแล้ว ยังสามารถมองเห็นน้ำตกสิริภูมิได้อีกด้วย'  ,
  Location:'บ้านขุนกลาง ต.บ้านหลวง อ.จอมทอง จ.เชียงใหม่',
  phone:'052 066 946',
  Price:'ราคาเริ่มต้น 1,575 – 2,400 บาท **ราคารวมอาหารเช้า (ราคาห้องพักอาจมีการเปลี่ยนแปลงกรุณาโทรสอบถามอีกครั้ง)',
  link: 'www.thegarden-th.com',
  Facebook:'The Garden Tent&House',

},
{ name:'บ้านสวนอริยะ เชียงใหม่ (Baan Suan Ariya)' , 
  img: "https://www.tripgether.com/wp-content/uploads/2022/10/Bansuanariya-97.jpg",
  img2: "https://www.tripgether.com/wp-content/uploads/2022/10/Bansuanariya-8.jpg",
  text_box:'ที่พักดอยอินทนนท์ ติดภูเขา วิวธรรมชาติแบบเต็มๆ มาพร้อมที่พักให้เลือกหลายแบบทั้ง บ้านพักพร้อมดาดฟ้า เต็นท์ VIP และแคมป์ บริเวณที่พักยังมีทั้งแปลงดอกไม้ที่หมุนเวียนไปตามซีซั่น ไม่เท่านั้นยังมีสวนผักและสวนผลไม้ไม่ว่าจะ องุ่น สตรอว์เบอร์รี่ ลูกท้อ อะโวคาโด และเสาวรส ให้เก็บแบบสดๆ บอกเลยว่าฟินมาก ช่วงเย็นยังสามารถสั่งหมูกระทะมากินเคล้าอากาศเย็นๆ หน้าที่พักได้อีกด้วย ใครมองหาที่พักท่ามกลางธรรมชาติและสวนผลไม้แนะนำเลยว่ามาที่บ้านสวนอริยะถูกใจแน่นอน' ,
  Location:'159 ม.7 หมู่บ้านขุนกลาง ต.บ้านหลวง อ.จอมทอง จ.เชียงใหม่' ,
  phone:'084 366 4300',
  Price:'ช่วงเดือนตุลาคม – พฤศจิกายน ราคาเริ่มต้น 800 บาท **ราคารวมอาหารเช้า ช่วงเดือนธันวาคม – มกราคม ราคาเริ่มต้น 1,000 บาท **ราคารวมอาหารเช้า (ราคาห้องพักอาจมีการเปลี่ยนแปลงกรุณาโทรสอบถามอีกครั้ง)',
  Facebook:'บ้านสวนอริยะ ที่พักดอยอินทนนท์',
},
{ name: 'บ้านไม้ไผ่ยักษ์, เชียงใหม่ (Giant Bamboo Hut)' , 
  img: "https://www.tripgether.com/wp-content/uploads/2022/10/Giantbamboo-13.jpg",
  img2: "https://www.atmangu.com/uploads/article/t2o962GR0PWZUN7VdTm1j5Ip0UFjw24c.jpg",
  text_box:'ที่พักดอยอินทนนท์ บ้านแม่กลางหลวง ที่ด้านหลังติดภูเขา ด้านหน้าติดทุ่งนา เรียกได้ว่าโอบล้อมด้วยธรรมชาติแบบ 360 องศา ในบรรยากาศอันแสนเงียบสงบให้คุณได้พักผ่อนและฟังเสียงธรรมชาติ นกร้อง น้ำไหล สายลมได้แบบสบายๆ ไม่เท่านั้นเดินถัดจากทุ่งนาไปยังมีน้ำตกสายเล็กๆ ไหลผ่านให้แช่เท้าเติมความสดชื่นกันได้อีกด้วย บอกเลยว่าเมื่อเข้าพักที่ Giant Bamboo Hut บ้านไม้ไผ่ยักษ์ คุณจะได้ใกล้ชิดธรรมชาติอย่างแท้จริง คุ้มค่าแก่การพาร่างกายมาชาร์จแบตในวันหยุดอย่างแน่นอน' ,
  Location:'บ้านแม่กลางหลวง อ.จอมทอง จ.เชียงใหม่' ,
  phone:'081 881 2471',
  Price:' ราคาเข้าพักสำหรับ 1 – 2 คน 1500 บาท/คน และราคาเข้าพักสำหรับ 3 คนขึ้นไป 1200 บาท/คน **รวมอาหาร 2 มื้อ เช้าและเย็น (ราคาอาจมีการเปลี่ยนแปลง กรุณาโทรสอบถามล่วงหน้า',
  Facebook:'Giant Bamboo Hut',
},
{ name:'โปโป&ปิงปิง ขุนวาง, เชียงใหม่ (PoPo & Pingping Farm Stay)' , 
  img: "https://img.wongnai.com/p/1920x0/2020/12/30/4e6b0962c02b4ebaa9e04dffb8998d17.jpg",
  img2: "https://www.tripgether.com/wp-content/uploads/2022/10/Pingpingandpopo-32.jpg",
  text_box:'เป็นที่พักเล็กๆ ตั้งอยู่กลางหมู่บ้านขุนวาง ชาวเขาเผ่าม้งบนดอยอินทนน์ ตกแต่งฟีลลิ่งญี่ปุ่นสุดน่ารัก บริเวณที่พักยังรายล้อมไปด้วยไม้ดอกและไม้ประดับมากมายที่ให้ความรู้สึกสดชื่นเข้ากับอากาศเย็นๆ เป็นที่สุด แอบกระซิบว่าที่ โปโป&ปิงปิง ขุนวาง นั้นเปิดให้เข้าพักเป็นช่วงๆ สามารถติดตามการเปิดให้จองได้ทางเฟซบุ๊กที่พักได้เลย นอกจากที่พักแล้วยังมีโซนคาเฟ่ให้นั่งชิลล์กันด้วย ใครมองหาที่พักดอยอินทนนท์น่ารักๆ ถ่ายรูปสวยแนะนำที่นี่เลย' ,
  Location:'80 ม.12 ต.แม่วิน อ.แม่วาง จ.เชียงใหม่' ,
  phone:'087 578 4946, 095 453 4784',
  Price:'เปิดให้เข้าพักตั้งแต่เดือนมิถุนายน – เดือนกุมภาพันธ์ ราคาเริ่มต้น 700 บาท/คน/คืน **รวมอาหารเช้า (ราคาอาจมีการเปลี่ยนแปลงกรุณาโทรสอบถามอีกครั้ง)',
  Facebook:'โปโป&ปิงปิง ขุนวาง',
},
])

const neartravel=ref([
{ name: 'พระมหาธาตุนภเมทนีดล พระมหาธาตุนภพลภูมิสิริ' , 
  img: "https://s.isanook.com/tr/0/ud/284/1424571/1-1-768x512.jpg?ip/resize/w728/q80/jpg",
  img2:"-",
  text_box:'สักการะ พระมหาธาตุนภเมทนีดล และ พระมหาธาตุนภพลภูมิสิริ ที่ประดิษฐานอยู่บริเวณทางแยกของถนนก่อนขึ้นยอดดอยอินทนนท์ โดย พระมหาธาตุนภเมทนีดล นั้นจะเป็นสีน้ำตาล สัณฐานทรงระฆัง 8 เหลี่ยม ถือเป็นพระมหาสถูปเจดีย์องค์แรกที่ตั้งอยู่สูงที่สุดในไทย ส่วน พระมหาธาตุนภพลภูมิสิริ นั้นจะเป็นทรง 12 เหลี่ยม สีม่วงอมชมพู ประดับโมเสกแก้ว ด้านในนั้นเป็นที่ประดิษฐานพระบรมสารีริกธาตุ หากมีโอกาสเดินทางไปยังยอดดอยอินทนนท์แล้ว ก็อย่าลืมแวะไปชมความสวยงามของพระมหาธาตุทั้ง 2 องค์ด้วยนะคะ' ,
  Location:' อุทยานแห่งชาติดอยอินทนนท์ ตำบลบ้านหลวง อำเภอจอมทอง จังหวัดเชียงใหม่' ,
  place:'https://goo.gl/maps/nH77dzuFqm4tx9gr8',
  Price:' คนไทย ผู้ใหญ่ 50 บาท เด็ก 20 บาท , ต่างชาติ ผู้ใหญ่ 200 บาท เด็ก 100 บาท',
  time:'05.00-17.00 น.',
},
{ name:'กิ่วแม่ปาน' , 
  img: "https://www.gooutthailand.com/wp-content/uploads/2022/09/kew-mae-pan-1.jpg",
  img2:"https://f.ptcdn.info/923/010/000/1381748685-CH225443-o.jpg",
  text_box:'  ไปกอดอากาศหนาว ชมทะเลหมอกสุดปังอลังการที่ กิ่วแม่ปาน จุดชมพระอาทิตย์ขึ้น และจุดชมทะเลหมอกที่สวยงามมากที่สุดแห่งหนึ่งในประเทศไทย อีกทั้งยังมีเส้นทางเดินศึกษาธรรมชาติที่จะพาเราเดินชมธรรมชาติอุดมสมบูรณ์ภายใน อุทยานแห่งชาติดอยอินทนนท์ ในระยะทางประมาณ  3-5 กิโลเมตรด้วยค่ะ ตลอดทางเราก็จะได้พบกับพืชพรรณนานาชนิด น้ำตก และวิวสวยๆ ระหว่างการเดินทางบนสันเขา เมื่อมาถึงจุดชมวิวของกิ่วแม่ปาน เห็นภาพของพระมหาธาตุเจดีย์คู่ และแนวเขาที่ปกคลุมไปด้วยทะเลหมอกสีขาว ก็รู้สึกหายเหนื่อยในพริบตา' ,
  Location:'อุทยานแห่งชาติดอยอินทนนท์ บริเวณกิโลเมตรที่ 43 ของถนนจอมทอง-ดอยอินทนนท์ อำเภอจอมทอง สันป่าตอง และแม่แจ่ม จังหวัดเชียงใหม่' ,
  place:'https://goo.gl/maps/tfkjFPX4YGbzRWAC9',
  Price:'-',
  time:'06.00-16.00 น.',
},
{ name: 'น้ำตกแม่ยะ' , 
img: "https://thesunsight.com/wp-content/uploads/2020/01/MY01-copy.jpg",
  img2:"https://thesunsight.com/wp-content/uploads/2020/01/MY02-copy.jpg",
  text_box:'น้ำตกขนาดใหญ่ที่สุดในอุทยานแห่งชาติดอยอินทนนท์ ด้วยความสูงกว่า 260 เมตร พร้อมกับสายน้ำที่ไหลลดหลั่นลงมาถึง 30 ชั้น ทำให้ที่นี่ได้รับการยกย่องให้เป็นหนึ่งในน้ำตกที่สวยที่สุดในประเทศไทยค่ะ พวกเราสามารถเที่ยวน้ำตกแม่ยะได้ตลอดทั้งปี แต่ช่วงฤดูฝนคือช่วงที่สวยที่สุด แถมธรรมชาติรอบด้านก็มีความร่มรื่นมากๆ ด้วย' ,
  Location:'อุทยานแห่งชาติดอยอินทนนท์ ตำบลบ้านหลวง อำเภอจอมทอง จังหวัดเชียงใหม่' ,
  place:'https://goo.gl/maps/xXBwe6fohXqXhu519',
  Price:'-',
  time:'08.00-17.00 น.',
},
{ name: 'บ้านแม่กลางหลวง' , 
  img: "https://cms.dmpcdn.com/travel/2020/11/18/ccfd3850-297d-11eb-8c49-6ff1aae212a5_original.jpg",
  text_box:'จุดแวะพักก่อนไปเที่ยวกันต่อในดอยอินทนนท์ ตั้งอยู่บนลุ่มแม่น้ำแม่กลาง ซึ่งเป็นลุ่มแม่น้ำชั้นที่ 3 ของดอยอินทนนท์ และเป็นที่อยู่อาศัยของชาวปกาเกอะญอ ซึ่งส่วนใหญ่จะทำอาชีพทำไร่ทำนา ปลูกข้าว และปลูกกาแฟเป็นหลัก ตัวหมู่บ้านจึงรายล้อมไปด้วยนาขั้นบันได และไร่กาแฟ ซึ่งจะงดงามสุดๆ ในช่วงฤดูฝนและปลายฝนต้นหนาวค่ะ จะไปถ่ายรูปกับทุ่งนาแสนสวย หรือจิบกาแฟหอมกรุ่นก็ฟินทั้งคู่ 😊☕️' ,
  Location:'ตำบลบ้านหลวง อำเภอจอมทอง จังหวัดเชียงใหม่' ,
  place:'https://goo.gl/maps/ZSAi4tMmoER7DZ4E9',
  Price:'-',
  time:'เข้าชมได้ตลอดทั้งวัน',
},
  
])
</script>

<style>

.card-img-top{
height: 100%;
padding: 25px;

}
.box_all{
justify-content: center;
align-items: center;
margin-left: 30%;
text-align: center
}

</style>
