<template>
  <div class="col" v-for="(n) in travellist" :key="n">
    <div class="name">
      <h3>{{ n.name }}</h3>
    </div>
    <div class="tipark">
      <RouterLink to="ที่พัก">ที่พัก</RouterLink> /
      <RouterLink to="สถานที่เที่ยว">สถานที่เที่ยว</RouterLink>
    </div>
    <br>
  <br>
    <div class="col" v-for="(stay, index) in stayy" :key="index">
      <div class="name">
        <div class="name">
        <img :src="stay.img" alt="รูปภาพ 1">
        <img :src="stay.img2" alt="รูปภาพ 2">
        <br><br>
        <h4>{{ stay.name }}</h4>
      </div>
      <div class="tipark">
        <p>{{ stay.text_box }}</p>
        <p>สถานที่ : {{ stay.Location }}</p>
        <p>เบอร์ติดต่อ : {{ stay.phone }}</p>
        <p>ราคา :{{ stay.Price }}</p>
        <p>Facebook : {{ stay.Facebook }}</p>
        <a :href=" stay.link">ที่พัก</a>
      </div>
    </div>
  </div>
  <h3>สถานที่เที่ยวใกล้ๆ</h3>
  <div class="col" v-for="(near, index) in neartravel" :key="index">
      <div class="name">
        <div class="name">
        <h4>{{ near.name }}</h4>
      </div>
      <div class="titravel">
        <a :href="near.place">พิกัด</a>
      </div>
    </div>
  </div>
  </div>
</template>

<script setup>

import { ref } from 'vue';

const travellist=ref([
{name: 'ป่าปงเปียง', img:"https://www.reviewchiangmai.com/wp-content/uploads/2022/06/Pa-Pong-Piang.png", quantity: 0 ,
text_box:'เดินทางโดยสวัสดิภาพ'
}])

const stayy=ref([
  {name:'Giant Bamboo Hut' , 
  img: "https://www.tiewluem.com/wp-content/uploads/2018/12/40258789_1404677209666965_3701800022858268672_o-1024x682.jpg",
  img2:"https://www.chillpainai.com/src/wewakeup/scoop/images/f2acad91d027d3086aefc7411802d90682d6b806.jpg ",
  text_box:'ที่พักเชียงใหม่สุดเก๋ โอบล้อมด้วยทุ่งนาชั้นบันได ฟังเสียงน้ำไหล ที่บ้านแม่กลางหลวง อำเภอจอมทอง จังหวัดเชียงใหม่ หมู่บ้านนาขั้นบันไดเชียงใหม่ที่อยู่ระหว่างเส้นทางขึ้นยอดดอยอินทนนท์ ถนนสภาพดีเข้าถึงหมู่บ้าน การเดินทางสะดวก ฤดูกาลท่องเที่ยวของที่นี่จะเริ่มตั้งแต่ช่วงเดือนกันยายน ไปจนถึงเดือนพฤศจิกายน เป็นที่เที่ยวหน้าฝนที่เราจะได้ชมทุ่งนาสีเขียวขจี ยาวไปจนถึงช่วงเก็บเกี่ยวรวงข้าวสีทองในต้นฤดูหนาว อ่านต่อได้ที่'  ,
  Location:'',
  phone:'081 881 2471',
  Price:'มา 1 – 2 คน จ่ายคนละ 1500 บาท มา 3 – 6 คน จ่ายคนละ 1200 บาท ราคารวมอาหารสองมื้อ เย็น – เช้า',
  link: 'https://maps.app.goo.gl/QiYstLr5kMBBuWgB6 ',
  Facebook:'Giant Bamboo Hut',
},
{name:'บ้านระเบียงนา ป่าบงเปียง' , 
  img: "https://www.hellorainy.60เส้นทางความสุข.com/wp-content/uploads/2020/04/1.%E0%B8%9A%E0%B9%89%E0%B8%B2%E0%B8%99%E0%B8%9B%E0%B9%88%E0%B8%B2%E0%B8%9A%E0%B8%87%E0%B9%80%E0%B8%9B%E0%B8%B5%E0%B8%A2%E0%B8%87-1.jpg",
  img2:"https://www.chillpainai.com/src/wewakeup/scoop/images/78f63f543af4b05f7fed8544ffb6c744a8f953fb.jpg",
  text_box:'ที่พักวิวทุ่งนาขั้นบันได ม่อนนาป่าบงเปียง โฮมสเตย์แบบบ้านๆ แต่ทัศนียภาพสุดอลังการ เบื้องหน้าเป็นภูเขาสลับซับซ้อน บรรยากาศธรรมชาติ เหมาะแก่การมาพักผ่อนเอนกายให้พื้นที่สีเขียวช่วยฮิลร่างกายและจิตใจ บริการบ้านพักในรูปแบบโฮมสเตย์ ราคาคิดเป็นหัว รวมอาหารเย็นและอาหารเช้า ภายในมีที่นอนหมอนมุ้งผ้าห่มให้ ไม่มีไฟฟ้า มีไฟโซล่าเซลล์ให้ แนะนำให้พกไฟฉายหรือตะเกียงมาเองด้วย รวมถึงพาวเวอร์แบงค์สำหรับชาร์มือถือและกล้อง เซ็ตหมูกระทะต้องติดต่อกับทางที่พักโดยตรง หรือเตรียมวัตถุดิบและอุปกรณ์มาเองก็ได้เช่นกัน อย่าลืมถ่าน เช็คอินเวลา 13.00 น. และเช็คเอาท์เวลา 11.00 น. มาไวๆ รีบถ่ายรูปก่อนแสงหมด เพราะกลางคืนจะมืดมาก แต่เห็นหมู่ดาวเต็มท้องฟ้า'  ,
  Location:'ต.ช่างเคิ่ง อ.แม่แจ่ม จ.เชียงใหม่, 50270',
  phone:' 0807946883',
  Price:'คนละ 700 บาท รวมอาหารเย็นและอาหารเช้าแล้ว* ส่วนลานกางเต็นท์ คนละ 100 บาท ไม่รวมอาหารเย็นและเช้า ต้องเตรียมมาเอง หรือหากต้องการอาจมีค่าใช้จ่ายเพิ่มเติม',
  link: 'https://maps.app.goo.gl/KKnrqf8xxVEY6vYz8 ',
  Facebook:'บ้านระเบียงนา ป่าบงเปียง https://www.facebook.com/sombutchai02577',
},
{name:'บ้านไม้ไผ่ นาขั้นบันไดป่าบงเปียง' , 
  img: "https://www.chillpainai.com/src/wewakeup/scoop/images/1dc5f33fd20b03f511f26310068dbc410ecb94a3.jpg",
  img2:"https://www.chillpainai.com/src/wewakeup/scoop/images/d4a4a523fd0c394a21d7fc5f8f76c6cb8e051b3b.jpg",
  text_box:'บ้านไม้ไผ่ ป่าบงเปียง โฮมสเตย์กลางนาขั้นบันได วิวสุดอลัง ทิวเขาสลับซับซ้อน สามารถมองเห็นทะเลหมอกได้จากที่พัก บรรยากาศดีมาก เหมาะแก่หนีความวุ่นมาหาความสงบ โดยที่นี่บริการบ้านพักทั้งหมด 4 หลัง คือ บ้านไม้ไผ่ 1 เข้าพักได้ 2-3 คน, บ้านไม้ไผ่ 2 (บ้านแฝด) เข้าพัก 4 คนขึ้นไป และบ้านไม้ไผ่ 3 หลังใหญ่ เข้าพัก 3 คนขึ้นไป ภายในบ้านพักมีที่นอน หมอน มุ้ง และผ้าห่ม มีห้องน้ำในตัว อาหารเย็นเป็นชุดขันโตก มีหมูกระทะจำหน่ายชุดละ 300 บาท (ต้องสั่งล่วงหน้า) หรือถ้านำวัตถุดิบมาเองก็ได้เช่น ทางที่พักมีเตาให้ยืม บริเวณที่พักมีสะพานไม้ไผ่ สามารถเดินเล่น ชมวิว และถ่ายรูปได้ จัดเป็นอีกหนึ่งที่พักแนะนำ ที่เหมาะแก่มานอนชิลล์ฟีลธรรมชาติ จองแล้วไปแอ่วกัน'  ,
  Location:'ต.ช่างเคิ่ง อ.แม่แจ่ม จ.เชียงใหม่, 50270',
  phone:'08-350-54726, 09-3990-7240',
  Price:'คนละ 600 บาท รวมอาหารเย็นและอาหารเช้าแล้ว* บ้านหลังใหญ่ กรณีพัก 2-3 คน คนละ 700 บาท รวมอาหารเย็นและอาหารเช้าแล้วเช่นกัน',
  link: 'https://maps.app.goo.gl/ZePbxqah2Puab5U28 ',
  Facebook:' บ้านไม้ไผ่ นาขั้นบันไดป่าบงเปียง https://www.facebook.com/banmaiphaii ',
},
{name:'กระท่อมชาวนา' , 
  img: "https://www.checkinchill.com/wp-content/uploads/checkinchill-22-8-2022-83.jpg",
  img2:"https://www.checkinchill.com/wp-content/uploads/checkinchill-22-8-2022-74.jpeg",
  text_box:' กระท่อมชาวนา โฮมสเตย์กลางนา วิวดี รายล้อมไปด้วยธรรมชาติ ล้อมรอบไปด้วยทุ่งนาขั้นบันไดสุดเขียวขจี ฟีลชนบท ตัวบ้านเป็นกระท่อมไม้มุงจาก ให้บริการบ้านพักด้วยกัน 2 หลัง เข้าพักได้ไม่เกิน 6 คน/หลัง มีที่นอน หมอน มุ้ง และผ้าห่มให้ ราคารวมอาหารเย็นและอาหารเช้าแล้ว ไม่มีไฟฟ้า มีไฟโซล่าเซลล์และเทียนให้ แต่ควรเตรียมไฟฉาย/ตะเกียง มาเองด้วย เผื่อเอาไว้ก่อน ส่วนอาหารอย่างอื่น สามารถเตรียมวัตถุดิบและอุปกรณ์มาทำเองได้ ใครที่สนใจกระท่อมชาวนา สามารถโทรไปสอบถามหรืออินบ็อกไปทางเฟซบุ๊คได้เลย'  ,
  Location:'ต.ช่างเคิ่ง อ.แม่แจ่ม จ.เชียงใหม่, 50270',
  phone:'097-171-8041',
  Price:'คนละ 700 บาท รวมอาหารเย็นและอาหารเช้าแล้ว ',
  link: 'https://maps.app.goo.gl/tWoTx5xvHDThyKkQ8 ',
  Facebook:'กระท่อมชาวนา  https://www.facebook.com/profile.php?id=100063512563331',
},
{name:'วีรศักดิ์ โฮมสเตย์ บ้านป่าบงเปียง' , 
  img: "https://www.checkinchill.com/wp-content/uploads/checkinchill-22-8-2022-28.jpeg",
  img2:"https://img.wongnai.com/p/1920x0/2018/09/08/c11ea73674de40e6aec946ca9194c9e3.jpg",
  text_box:' วีรศักดิ์ โฮมสเตย์ บ้านป่าบงเปียง ที่พักวิวทุ่งนาขั้นบันได ทัศนียภายงดงามมาก ทำเลบ้านอยู่ในจุดที่สูง ทำให้ตอนเช้าจะเห็นทะเลหมอกสีขาวลอยละล่องผ่านทิวเขา มาพักผ่อนช่วงนาเขียวๆ คงดีมากเลยล่ะ ที่นี่บริการบ้านพัก 2 หลัง คือ บ้านหลังเล็ก พักได้ไม่เกิน 4 คน มีห้องน้ำส่วนตัว ระเบียงหน้าบ้าน และบ้านหลังใหญ่ 2 ห้องนอน 2 ห้องน้ำ เหมาะกับครอบครัว พักได้ 4-8 คน หากเกินจากนี้นำเต็นท์มากางบริเวณระเบียงไม้ไผ่ได้ ตัวบ้านกว้างขวาง มีพื้นที่ทำกิจกรรม ระเบียงข้างบ้าน และพื้นที่เล็กๆ ทำอาหาร มีเตาอั้งโล่ ถ้วย จาน ชาม ช้อน แก้วน้ำ ส่วนเครื่องปรุง ถ่าน และอุปกรณ์อื่นๆ ต้องนำมาเอง ถ้าหากอยากกินหมูกระทะ ต้องเตรียมวัตถุดิบ และถ่านมาเอง ทางที่พักมีเตาอั้งโล่, เตาหมูกระทะ, ถ้วย, และจานให้ยืม ปิ้งสามชั้นร้อนๆ ทานคู่กับเครื่องดื่มเย็นๆ พร้อมดูดาว นิพพาน'  ,
  Location:'ต.ช่างเคิ่ง อ.แม่แจ่ม จ.เชียงใหม่, 50270',
  phone:'082-623-2883',
  Price:'คนละ 700 บาท รวมอาหารเย็นและอาหารเช้าแล้ว* บ้านหลังใหญ่หากพักไม่ถึง 3 คน คิดราคาเหมาหลัง 1,500 บาท',
  link: 'https://www.facebook.com/weerasuk.homestay/',
  Facebook:'วีรศักดิ์ โฮมสเตย์ บ้านป่าบงเปียง  ',
},
{name:'คาเฟ่และร้านอาหารบ้านป่าบงเปียง' , 
  img: "https://th.bing.com/th/id/OIP.IvSmLrnLnKdt4IODc9OR_wHaE7?pid=ImgDet&rs=1",
  img2:"https://thumbs.dreamstime.com/b/breakfast-rice-paddy-terrace-fields-philippines-banaue-batad-infugao-luzon-60712171.jpg",
  text_box:'ระเบียงนา คาเฟ่ ป่าบงเปียง ร้านอาหารและคาเฟ่ ที่มีวิวสวยและอร่อย ทั้งอาหารและเครื่องดื่ม อีกทั้งผลิตภัณฑ์สินค้าชุมชน ส่วนใหญ่เมนูนํ้า เปิด ศุกร์ เสาร์ อาทิตย์และวันหยุด'  ,
  Location:'',
  phone:'097 981 4259',
  Price:'-',
  link: ' https://maps.app.goo.gl/s1UMK4F7YytbiTgn9',
  Facebook:' https://www.facebook.com/noochduangrudee/?locale=th_TH',
},
])

const neartravel=ref([
{ name: 'ถนนทางเข้าไปบ้านป่าบงเปียงมีทางแยกก่อนเข้าหมู่ เป็นเส้นทางผ่านของ น้ำตกแม่ปาน ที่นักท่องเที่ยวสามารถแวะชมได้ ใกล้ชิดกับธรรมาชาติได้' , 
  place:'https://maps.app.goo.gl/8TjNLD5cCvwyANzLA',
},

  
])
</script>

<style>

.card-img-top{
height: 100%;
padding: 25px;

}
.box_all{
justify-content: center;
align-items: center;
margin-left: 30%;
text-align: center
}

</style>
