<template>
  <div class="col" v-for="(n) in travellist" :key="n">
    <div class="name">
      <h3>{{ n.name }}</h3>
    </div>
    <div class="tipark">
      <RouterLink to="ที่พัก">ที่พัก</RouterLink> /
      <RouterLink to="สถานที่เที่ยว">สถานที่เที่ยว</RouterLink>
    </div>
    <br>
  <br>
    <div class="col" v-for="(stay, index) in stayy" :key="index">
      <div class="name">
        <div class="name">
        <img :src="stay.img" alt="รูปภาพ 1">
        <img :src="stay.img2" alt="รูปภาพ 2">
        <br><br>
        <h4>{{ stay.name }}</h4>
      </div>
      <div class="tipark">
        <p>{{ stay.text_box }}</p>
        <p>สถานที่ : {{ stay.Location }}</p>
        <p>เบอร์ติดต่อ : {{ stay.phone }}</p>
        <p>ราคา :{{ stay.Price }}</p>
        <p>Facebook : {{ stay.Facebook }}</p>
        <a :href="stay.link">ที่พัก</a>
      </div>
    </div>
  </div>
  <h3>สถานที่เที่ยวใกล้ๆ</h3>
  <div class="col" v-for="(near, index) in neartravel" :key="index">
      <div class="name">
        <div class="name">
        <img :src="near.img" alt="รูปภาพ 1">
        <br><br>
        <h4>{{ near.name }}</h4>
      </div>
      <div class="titravel">
        <p>{{ near.text_box }}</p>
        <p>สถานที่ : {{ near.Location }}</p>
        <p>เบอร์ติดต่อ : {{ near.phone }}</p>
        <p>ราคา :{{ near.Price }}</p>
        <p>เวลา : {{ near.time }}</p>
        <a :href=" near.place">พิกัด</a>
      </div>
    </div>
  </div>
  </div>
</template>

<script setup>

import { ref } from 'vue';

const travellist=ref([
{name: 'ดอยม่อนแจ่ม', img:"https://www.reviewchiangmai.com/wp-content/uploads/2022/06/doi-mon-cham-1536x1024.jpg", quantity: 0 ,
text_box:'เดินทางโดยสวัสดิภาพ'
}])

const stayy=ref([
{name:'ไร่ภูพญา ม่อนแจ่ม' , 
  img: "https://static.wixstatic.com/media/4ad56c_48a9c3162f5b46018aa0273b11be36d5~mv2.jpg/v1/fill/w_980,h_551,al_c,q_85,usm_0.66_1.00_0.01,enc_auto/4ad56c_48a9c3162f5b46018aa0273b11be36d5~mv2.jpg",
  img2:"https://th.bing.com/th/id/OIP.wrmDuvGtKD0_lYPcatmtvAHaE7?pid=ImgDet&w=474&h=315&rs=1",
  text_box:'ใครชอบนอนเต็นท์ มาทางนี้เลย กับที่พักท่ามกลางธรรมชาติ ไร่ภูพญา ม่อนแจ่ม ในบรรยากาศสบายๆ ทัศนียภาพสวยงาม ทั้งภูเขาและสวนผักขั้นบันได มีสายหมอกสีขาวลอยพาดผ่าน อากาศเย็นสบาย ให้คุณได้สูดอากาศบริสุทธิ์ ผ่อนคลายไปกับพื้นที่สีเขียวในไร่ภูพญา บริการที่พัก พร้อมอาหารเช้า ในรูปแบบเต็นท์ มีให้เลือก 2 แบบ คือ Dome Tent เข้าพักได้ 2 คน และ Family Tent เข้าพักได้ 4 คน เหมาะกับครอบครัว-กลุ่มเพื่อน ภายในเต็นท์มีสิ่งอำนวยความสะดวกต่างๆ มีไฟฟ้า ปลั๊ก พัดลมไอเย็น ชั้นวางของ กระจก ผ้าเช็ดตัว ผ้าเช็ดเท้า น้ำดื่ม พร้อมพื้นที่นั่งเล่น ตัวเต็นท์กันฝนกันน้ำค้าง มีหน้าต่างใส นอนมองวิวม่อนแจ่มได้แบบฟินๆ ห้องน้ำส่วนตัว สะอาด มีน้ำอุ่น ไม่ต้องกลัวหนาว ตกดึกนั่งกินหมูกระทะแบบฟินๆ นอนดูดาวสวยๆ สามารถพักผ่อนได้ตลอดทั้งปี ใครสนใจสามารถแอดไลน์ไปจองหรือโทรไปสอบถามได้จากข้อมูลด้านล่าง ราคาที่พักรวมอาหารเช้าแล้ว เอ้อ แถมที่นี่ยังอยู่ไม่ไกลจากแหล่งท่องเที่ยว ทั้งม่อนแจ่ม ไร่สตรอเบอร์รี่ และสวนดอกไม้ อย่าลืมเตรียมเสื้อผ้าสวยๆ ไปถ่ายรูป ลงโซเชียล อวดเพื่อนกันด้วยนะ'  ,
  Location:'84 หมู่ 7 ต.แม่แรม อ.แม่ริม จ.เชียงใหม่, 50180 https://goo.gl/maps/hgJoD4HTTaJYY1nE8',
  phone:'087-932-4440',
  Price:'ราคาขึ้นอยู่กับฤดูกาล',
  link: 'https://xn--e3c7afl2fub9d7a.com/',
  Facebook:'ไร่ภูพญา เชียงใหม่',
},
{name:'หนองหอยแคมป์' , 
  img: "https://accommodation12.weebly.com/uploads/8/2/5/8/82585298/93203819-2833642223420201-1394878908133801984-o_orig.jpg",
  img2:"https://th.bing.com/th/id/OIP.xPmjUoxc1hB-3Kc4hayZhAHaEo?pid=ImgDet&w=474&h=296&rs=1",
  text_box:'ต่อกันที่ หนองหอยแคมป์ ที่พักดีไซน์สวย บนดอยม่อนแจ่ม มากไปด้วยมุมถ่ายรูปสุดปัง ที่สาวๆ จะต้องเลิฟ โลเคชั่นสะดวก ติดถนนหลัก ติดกับสถานีม่อนม้ง ชวนคุณมานั่งดูดอย นอนดูดาว สัมผัสอากาศหนาวแบบฟินๆ โดยที่นี่ให้บริการบ้านพักจำนวน 6 หลัง มีด้วยกัน 2 แบบ คือ บ้านแสงจันทร์ 2 หลัง เป็นบ้านสไตล์โมเดิร์นแบบผสม ตกแต่งด้วยไม้ฟาก ทำให้กลมกลืนไปกับธรรมชาติ ภายในกว้างขวางไม่อึดอัด มีระเบียงหน้าบ้าน ไว้นั่งเล่นพักผ่อน และเต็นท์ดูดาว 4 หลัง เต็นท์ใสที่สามารถนอนดูดาวได้ทั้งคืน มีผ้าม่าน และห้องน้ำส่วนตัว ที่แยกส่วนเปียกส่วนแห้งไว้อย่างชัดเจน ทำให้ห้องน้ำสะอาดและสะดวกต่อการใช้งาน ด้านหน้ามีระเบียงพร้อมโต๊ะเก้าอี้ให้นั่งเล่น รวมถึงตาข่าย ทั้งสองแบบสามารถเข้าพักได้ 2 คน เสริมได้ 1 คน และราคาขึ้นอยู่กับช่วงเดือน มีสิ่งอำนวยความสะดวกครบครัน ทั้งพัดลม, เครื่องฟอกอากาศ, ผ้าเช็ดตัว, ชั้นวางของ, ปลั๊กไฟ, เครื่องทำน้ำอุ่น, สบู่อาบน้ำ, แชมพู และรองเท้าใส่ในบ้าน ช่วงเย็นมีชุดหมูกระทะจำหน่าย สั่งทานที่หน้าบ้านได้เลย ปิ้งหมูร้อนๆ พร้อมจิบเครื่องดื่มเย็นๆ ดีไม่ไหว อีกทั้งบริเวณที่พักยังเต็มไปด้วยหญ้าน้ำพุ ปลิวสไวเล่นลม รอคุณมาถ่ายรูปสวยๆ อยู่นะ ใครที่สนใจอยากไปพักที่หนองหอย อินบ็อกเข้าไปสอบถามได้ที่หน้าเพจเฟซบุ๊ค หรือถ้าไม่ทันใจโทรสอบถามตามคอนแทคด้านล่างได้เลย'  ,
  Location:'87/3 หมู่ 11 ต.แม่แรม อ.แม่ริม จ.เชียงใหม่, 50180',
  phone:'097-3286124',
  Price:'ห้องพักทั้ง 2 แบบ ราคาเท่ากัน, แอร์เพิ่ม 500 บาท (บ้านแสงจันทร์ 2), แอร์เพิ่ม 300 บาท (เต็นท์ดูดาว 1), เสริมแบบไม่มีที่นอน 300 เสริมแบบมีที่นอน 500 บาท,​ เด็กอายุต่ำกว่า 10 ขวบ เข้าพักฟรีกับผู้ปกครอง, เด็ก 2 คน คิดเพิ่ม 300 บาท ราคาขึ้นอยู่กับฤดูกาล',
  link: 'https://goo.gl/maps/83eTU8gqt4gjCikf7',
  Facebook:'หนองหอยแคมป์ ที่พักบนดอยม่อนแจ่ม ',
},
{name:'ภูจรัสฟ้า ม่อนแจ่ม' , 
  img: "https://www.reviewchiangmai.com/wp-content/uploads/2020/07/1coverpu-2048x1365-cover-1536x864.jpg",
  img2:"https://th.readme.me/f/35728/5fbf2c7cb3e77a4a590cca55.jpg",
  text_box:'อีกหนึ่งที่พักน่านอน ภูจรัสฟ้า ม่อนแจ่ม โฮมสเตย์บรรยากาศธรรมชาติ บนดอยม่อนแจ่ม ให้คุณได้สัมผัสลมหนาว เคล้าทะเลหมอก พร้อมชมวิวสุดอลังการได้จากหน้าห้องพักของตัวเอง วิวเบื้องหน้าเป็นสวนผักขั้นบันไดและทิวเขาสลับซับซ้อนสุดลูกหูลูกตา ที่ทำให้คุณไม่อยากละสายตาเลยล่ะ ทั้งยังมีความเงียบสงบมาก เหมาะแก่การพักผ่อนสุดๆ เพราะโลเคชั่นที่นี่เค้าปลีกตัวออกมาจากรีสอร์ทอื่นๆ ทำให้คุณได้ผ่อนคลายอย่างแท้จริง ภูจรัสฟ้าให้บริการที่พักด้วยกัน 2 ประเภท ตั้งเรียงตัวไปตามไหล่เขา คือ เต็นท์โดม เข้าพักได้ 2 คน เสริมได้ 1 คน และเต็นท์แฟมิลี่ เข้าพักได้ 4 คน ทุกเต็นท์มีห้องน้ำส่วนตัว ภายในมีที่นอนพร้อมเครื่องนอน, พัดลม, ชั้นวางของ กาน้ำร้อน, ปลั๊กสามตา, น้ำดื่ม, แก้วน้ำ, ทิชชู่, ผ้าเช็ดตัว, สบู่, ยาสระผม, ไดร์เป่าผม, และไม้แขวนเสื้อ ด้านหน้ามีโต๊ะเก้าอี้ไว้นั่งชมวิว หรือปาร์ตี้หมูกระทะช่วงค่ำๆ มีจำหน่ายทั้งชุดเล็กและชุดใหญ่ รวมถึงเครื่องดื่มเย็นๆ ปิ้งหมูร้อนๆ พร้อมจิบเครื่องดื่ม นั่งพูดคุยเม้ามอยตามประสา มีความสุขไม่ไหว ตกกลางคืนนอนดูดาว ชมแสงจันทร์ โรแมนติกไปอีกแบบ ตื่นเช้ามาก็เดินออกมาตรงระเบียง ชมทะเลหมอกลอยสีขาวละล่อง บอกเลยว่าฟินสุดๆ ในส่วนของอาหารเช้า เสิร์ฟข้าวต้มหมู ขนมปังปิ้ง และชา/กาแฟ อิ่มอยู่ท้องแน่นอน พร้อมตะลุยเที่ยวต่อบนม่อนแจ่มได้เลย ใครที่กำลังมองหาโฮมสเตย์ราคาไม่แรง แต่บรรยากาศเลิศ แนะนำ ภูจรัสฟ้า ม่อนแจ่ม เลย กดปุ่มจองได้ตรงคอนแทคด้านล่าง หรือจะโทรไปสอบถามก็ได้เช่นกัน'  ,
  Location:'131/1 หมู่ 11 ต.แม่แรม อ.แม่ริม จ.เชียงใหม่, 50180 https://goo.gl/maps/xsBoQeSo6cKXQNRu6 ',
  phone:'087-807-1202',
  Price:'ราคาขึ้นอยู่กับฤดูกาล',
  link: 'https://reservation.roomscope.com/1535/th',
  Facebook:'ภูจรัสฟ้า ม่อนแจ่ม ',
},
{name:'บ้านภูหมอก ม่อนแจ่ม' , 
  img: "https://th.bing.com/th/id/R.81be59905d9b26bb3ffc021f22f2ae69?rik=MyAi6qktjJRwDA&pid=ImgRaw&r=0",
  img2:"https://th.bing.com/th/id/OIP.DFIuywlQLocck_8GEa_-EwHaE8?pid=ImgDet&w=474&h=316&rs=1",
  text_box:'หากใครการความเป็นส่วนตัว ปลีกวิเวกจากความวุ่นวาย แนะนำที่นี่เลยจ่ะ กับบ้านภูหมอก ที่พักท่ามกลางธรรมชาติ ตั้งอยู่บนเนินเขา บนความสูง 1,500 เมตร จากระดับน้ำทะเล ทัศนียภาพสวยงาม มองเห็นทิวเขาสลับซับซ้อน พร้อมกับทะเลหมอกสีขาว ให้คุณได้ผ่อนคลายอย่างแท้จริง บริการห้องพักหลากหลายแบบ พร้อมอาหารเช้า มีให้เลือก 4 โซน มีทั้งแบบบ้านพักและเต็นท์กระโจม ทุกหลังมีระเบียง สามารถนั่งชิมวิว ดูดาว นั่งกินหมูกระทะได้ ภายในมีสิ่งอำนวยความสะดวกต่างๆ มีชุดหมูกระทะจำหน่าย ด้านบนมีจุดชมวิว สามารถมองเห็นวิวได้แบบ 360 องศาเลยนะ'  ,
  Location:'118 หมู่ 11 ต.แม่แรม อ.แม่ริม จ.เชียงใหม่, 50180 https://g.page/baanphumork?share',
  phone:' 082-894-6861',
  Price:'สอบถามกับทางที่พัก',
  link: 'https://baanphumork.com/',
  Facebook:'บ้านภูหมอก ม่อนแจ่ม ',
},
{name:'หุบเขาดาวเหนือ' , 
  img: "https://i.ytimg.com/vi/_VSkY6eS0Co/maxresdefault.jpg",
  img2:"https://th.bing.com/th/id/OIP.cDHjXCCjVvF36SyWab9xOQHaFj?pid=ImgDet&w=474&h=355&rs=1",
  text_box:'หลายคนคงจะเคยเห็นรูปจากบนโซเชียลมีเดียกันแล้ว กับหุบเขาดาวเหนือ ที่พักสุดเก๋ ในรูปแบบบับเบิ้ลแกลมปิ้ง 360 องศา ให้คุณได้สัมผัสธรรมชาติอย่างใกล้ชิด ท่ามกลางหุบกลาง ผืนป่า ท้องฟ้า และดวงดวง บริการห้องพัก พร้อมอาหารเช้า มีให้เลือก 3 แบบ คือ ห้อง 3, 5, 6, 8 ไม่มีอ่างอาบน้ำและเครื่องทำอุ่น คืนละ 3,500 บาท, ห้อง 1, 2, 4, 7, 9, 10 มีอ่างอาบน้ำและเครื่องทำอุ่น คืนละ 3,990 บาท และสุดท้าย ห้อง 11 บับเบิ้ล รวมอาหาร 2 มื้อ คือ มื้อค่ำสุดพิเศษที่บับเบิ้ล และมื้อเช้าด้านบน คืนละ 8,990 บาท มีสิ่งอำนวยความสะดวกต่างๆ คาเฟ่วิวภูเขา บรรยากาศดีมาก สามารถนั่งจิบกาแฟ ทานอาหารได้ รีวิวเพียบ อาหารเช้าจัดเต็ม แถมจองยากมาก แนะนำให้จองล่วงหน้า 4 เดือนขึ้นไป'  ,
  Location:' 77/9 หมู่ 1 โป่งแยงในซอย 6 ต.โป่งแยง อ.แม่ริม จ.เชียงใหม่, 50180 https://goo.gl/maps/UYQzkgVvwVDxy5u5A ',
  phone:'080-565-111',
  Price:'-',
  link: 'https://www.facebook.com/people/North-Star-Valley-%E0%B8%AB%E0%B8%B8%E0%B8%9A%E0%B9%80%E0%B8%82%E0%B8%B2%E0%B8%94%E0%B8%B2%E0%B8%A7%E0%B9%80%E0%B8%AB%E0%B8%99%E0%B8%B7%E0%B8%AD/100065931462928/',
  Facebook:'FanPage North Star Valley ',
},
])

const neartravel=ref([
{ name: 'สวนดอกไม้และสวนส้มป้างฮวา' , 
  img: "https://www.paiduaykan.com/travel/wp-content/uploads/2021/11/6-SON09575.jpg",
  text_box:'ถ่ายรูปเช็กอินบรรยากาศสุดโรแมนติก ท่ามกลางดอกมากาเร็ตสีชมพูม่วง และเก็บส้มสด ๆ จากต้น ในสวนส้มสายพันธุ์ฟรีมองค์ เพียงกิโลกรัมละ 80 บาท ที่สวนดอกไม้และสวนส้มป้างฮวา ค่าเข้าผู้ใหญ่ 70 บาท และเด็ก 40 บาท มีพร็อพถ่ายรูปให้เพียบ ทั้งรองเท้าบู๊ท ตะกร้าดอกไม้ และตะกร้าสะพายหลัง' ,
  Location:'82 ม.11 ต.แม่แรม อ.แม่ริม จ.เชียงใหม่' ,
  place:'https://goo.gl/maps/yZaqa1rQABp145cc9',
  Price:'ราคา: ค่าเข้าชม ผู้ใหญ่ 50 บาท, เด็ก 30 บาท',
  time:'ปิดทุกวัน ตั้งแต่ 07.00-18.00 น.',
  phone:'065 447 2902',
},
{ name: '.โป่งแยงจังเกิ้ล โคสเตอร์และซิปไลน์ (Pongyang Jungle Coaster & Zipline)' , 
  img: "https://gangtravel.com/upload/2021/11/1-3_800x534.jpg.webp",
  text_box:'โป่งแยงจังเกิ้ล โคสเตอร์และซิปไลน์ (Pongyang Jungle Coaster & Zipline) ที่เที่ยวม่อนแจ่ม โป่งแยงจังเกิ้ล โคสเตอร์และซิปไลน์ ที่เที่ยวสุดมันส์ใครที่รักความตื่นเต้น ต้องไปเล่นเครื่องเล่นสุดท้าทาย ยกตัวอย่างความันส์เช่น Jungle Bike , Giant Swing , Jungle Coaster เป็นต้น และยังมีกิจกรรมทั้ง Zipline 36 สถานี, Quick Jump, Slider และ Easy Jumper ให้ได้เล่นกันอีกด้วย ใครชอบแอดเวนเจอร์ต้องห้ามพลาด' ,
  Location:'ต.โป่งแยง อ.แม่ริม จ.เชียงใหม่ (ก่อนถึงม่อนแจ่ม 2 กิโลเมตร)' ,
  place:' facebook.com/Pongyang Jungle Coaster Zipline Camp&Resort',
  Price:'-',
  time:' ทุกวัน วันจันทร์ – ศุกร์ เวลา 09.00-17.00 น./ วันเสาร์ – อาทิตย์ เวลา 08.30 – 17.30 น.',
  phone:' 053 106 327',
},
{ name: 'Skywalk ม่อนแจ่ม' , 
img: "https://www.paiduaykan.com/travel/wp-content/uploads/2019/11/33-SON03551-800x533.jpg",
  text_box:'สกายวอล์คม่อนเจ่มตั้งอยู่ติดกับไร่สตรอเบอรี่ปลายฟ้า โดยเสียค่าเข้าชมคนละ 10 บาท  เป็นทางเดินไม้ไผ่แบบสั้นๆ ระหว่างทางเดินประดับด้ยดอกไม้เมืองหนาวสีสันสดใส สามารถยืนชมวิว ถ่ายภาพ วิวทิวทัศน์ของภูเขาที่เรียงรายสลับซับซ้อนที่สามารถหยุดยืนชมได้ทุกจุด นอกจากนี้บริเวณด้านหน้ายังมีบริการเช่าชุดแบบชนเผ่าแบบม้ง ให้เช่าใส่ถ่ายภาพด้วย' ,
  Location:' พิกัด  4051 ตำบล แม่แรม อำเภอแม่ริม เชียงใหม่ 50180' ,
  place:'',
  Price:'',
  time:' ',
  phone:'',
},
{ name: 'ภูวินคาเฟ่ โฮมสเตย์ ม่อนแจ่ม' , 
  img: "https://www.paiduaykan.com/travel/wp-content/uploads/2019/11/SON03314.jpg",
  text_box:'กิน เที่ยว พัก จบครบในที่เดียวกับ ภูวินคาเฟ่ โฮมสเตย์ ม่อนแจ่ม พาร่างกายไปปะทะสายหมอกที่เมืองเหนือ ชมวิวความงามของม่อนแจ่ม ค้างคืนในโดมกระโจมท่ามกลางป่าเขา จัดปาร์ตี้หมูกระทะซดน้ำซุปร้อน ๆ ท่ามกลางอากาศหนามเย็นได้ที่นี่' ,
  Location:' พิกัด 92/1 หมู่11 แม่แรม อำเภอแม่ริม เชียงใหม่ 50180' ,
  place:'https://reservation.roomscope.com/1491/th?fbclid=IwAR03ydookCEpUgi9l7nI2SERMJ8u-2EKFqhtje-SdFFVD3S8AuxoHzwQyEE',
  Price:'',
  time:' เปิดทำการทุกวัน เวลา 6:00–20:00 น.',
  phone:'064 105 2041',
},
{ name: 'JINJU the orange farm – สวนส้มจินจู' , 
  img: "https://i0.wp.com/inzpy.com/wp-content/uploads/2022/03/jinju-the-orange-farm-cover.jpg?w=1200&ssl=1",
  text_box:' สวนส้มสไตล์เกาหลีแสนน่ารัก มากับบรรยากาศสดชื่น สัมผัสอากาศเย็นสบาย ชมวิวสวยเหมือนไปเที่ยวอยู่บนเกาะเจจู ด้วยการทำสวนที่ใช้รูปแบบขั้นบันไดในการปลูกต้นส้ม ทำให้เราสามารถเดินเล่นแบบชิล ๆ เพลิดเพลินไปกับการถ่ายรูปเช็คอินได้อย่างสบาย อีกหนึ่งความน่ารักของสวนส้มแห่งนี้คือมีการจัดมุมถ่ายรูป ทั้งมุมแคมป์ปิ้งและปิกนิคเข้ากับบรรยากาศโดยรอบมาก ๆ นอกจากนี้เรายังเก็บผลส้มสดกลับไปเป็นของฝากได้อีกด้วย ก่อนกลับแวะทานน้ำส้มคั้นสดจากสวนรับรองจะติดใจแน่นอน' ,
  Location:'https://goo.gl/maps/8UUWzaUkW3Pqh93k8' ,
  place:'https://goo.gl/maps/8UUWzaUkW3Pqh93k8',
  Price:'',
  time:' เปิดทุกวัน 08.00 – 18.00 น.',
  phone:'096 949 4503',
},
  
])
</script>

<style>

.card-img-top{
height: 100%;
padding: 25px;

}
.box_all{
justify-content: center;
align-items: center;
margin-left: 30%;
text-align: center
}

</style>
